HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/helyxMultiRegionHeater/system/topAir/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType    fluid;
muModel         scalarFunction1;
kappaModel      kappaPrandtl;
thermodynamics  hConst;
equationOfState perfectGas;
energy          sensibleEnthalpy;
molWeight       28.9;

thermodynamicsCoeffs
{
    Cp              1000;
    Hf              0;
}
muModelCoeffs
{
    mu              1.8e-05;
}
kappaModelCoeffs
{
    Pr              0.7;
}


// ************************************************************************* //
